# Pandas

Pandas is an open source library in python that is used to work with relational data both easily and intuitively.

This provides various data structures and operations for manipulating numerical data and time series.

It is built on top of NumPy and subsequently acts as the base for SciPy, Matplotlib and Scikit-learn.

In [1]:
# Let's first import the package/libraray

import pandas as pd

In [2]:
# checking the version

pd.__version__

'1.5.3'

### Pandas Data Structures

> Series

> Dataframe

## Series

It is a one-dimensional labeled array capable of holding data of any type.

In [3]:
mylist = [10,20,30,40,50]
print(type(mylist))

<class 'list'>

In [4]:
myseries = pd.Series(mylist)
myseries

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
type(myseries)

pandas.core.series.Series

Fetch values

In [6]:
myseries.values

array([10, 20, 30, 40, 50], dtype=int64)

In [7]:
myseries.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
myseries.items

<bound method Series.items of 0    10
1    20
2    30
3    40
4    50
dtype: int64>

In [9]:
myseries.ndim

1

In [10]:
myseries.shape

(5,)

In [11]:
myseries.count()

5

In [12]:
myseries.describe()

count     5.000000
mean     30.000000
std      15.811388
min      10.000000
25%      20.000000
50%      30.000000
75%      40.000000
max      50.000000
dtype: float64

In [13]:
myseries.mean()

30.0

In [14]:
myseries.min()

10

Customizing index

In [15]:
mylist = [100,200,300,400,500]
ilist = ['TATA','BIRLA','HCL','ITC','REL']
ps2 = pd.Series(mylist,index=ilist)
ps2

TATA     100
BIRLA    200
HCL      300
ITC      400
REL      500
dtype: int64

Frequencey

In [16]:
ps2.value_counts()

100    1
200    1
300    1
400    1
500    1
dtype: int64

In [17]:
ps2['TATA']

100

From Dictionary to Pandas Series

In [18]:
md1 = {'TATA':100,'ITC':200,'Wipro':300,'IBM':400}
md1

{'TATA': 100, 'ITC': 200, 'Wipro': 300, 'IBM': 400}

In [19]:
ms1 = pd.Series(md1)
ms1

TATA     100
ITC      200
Wipro    300
IBM      400
dtype: int64

In [20]:
type(ms1)

pandas.core.series.Series

Series Access

In [21]:
import numpy as np

np.random.seed(23)

In [22]:
n10 = np.random.randint(low = 10,high = 100,size = 10)
n10

array([93, 50, 83, 64, 41, 86, 49, 35, 61, 16])

In [23]:
ilist = ['C1','C2','C3','C4','C5','C6','C7','C8','C9','C10']

In [24]:
ps3 = pd.Series(n10,index=ilist)
ps3

C1     93
C2     50
C3     83
C4     64
C5     41
C6     86
C7     49
C8     35
C9     61
C10    16
dtype: int32

In [25]:
ps3[0]

93

In [26]:
ps3['C1']

93

In [27]:
ps3[1:5]

C2    50
C3    83
C4    64
C5    41
dtype: int32

String slice end point is included when using loc

In [28]:
ps3.loc['C3':'C6']

C3    83
C4    64
C5    41
C6    86
dtype: int32

Pull out random index

In [29]:
ps3[['C1','C2','C3','C4']]

# The "interior" brackets is for the list
# The "exteriror" brackets is for the index

C1    93
C2    50
C3    83
C4    64
dtype: int32

In [30]:
ps3>40

C1      True
C2      True
C3      True
C4      True
C5      True
C6      True
C7      True
C8     False
C9      True
C10    False
dtype: bool

In [31]:
ps3[ps3>40]

C1    93
C2    50
C3    83
C4    64
C5    41
C6    86
C7    49
C9    61
dtype: int32

In [32]:
ps3[(ps3>40) & (ps3%2==0)]

C2    50
C4    64
C6    86
dtype: int32

## DataFrames

In [33]:
md1 = {'vol':[100,200,300,400],'Rev':[110,210,310,410],'Exp':[120,220,320,420],'HQ':['MB','BLR','KOL','CHN']}
md1

{'vol': [100, 200, 300, 400],
 'Rev': [110, 210, 310, 410],
 'Exp': [120, 220, 320, 420],
 'HQ': ['MB', 'BLR', 'KOL', 'CHN']}

In [34]:
row_index = ['INFY','CTS','TCS','TECHON']

In [35]:
df1 = pd.DataFrame(md1,index = row_index)
df1

        vol  Rev  Exp   HQ
INFY    100  110  120   MB
CTS     200  210  220  BLR
TCS     300  310  320  KOL
TECHON  400  410  420  CHN

In [36]:
df1.describe()

              vol         Rev         Exp
count    4.000000    4.000000    4.000000
mean   250.000000  260.000000  270.000000
std    129.099445  129.099445  129.099445
min    100.000000  110.000000  120.000000
25%    175.000000  185.000000  195.000000
50%    250.000000  260.000000  270.000000
75%    325.000000  335.000000  345.000000
max    400.000000  410.000000  420.000000

In [37]:
df1.describe(include=[np.number])

              vol         Rev         Exp
count    4.000000    4.000000    4.000000
mean   250.000000  260.000000  270.000000
std    129.099445  129.099445  129.099445
min    100.000000  110.000000  120.000000
25%    175.000000  185.000000  195.000000
50%    250.000000  260.000000  270.000000
75%    325.000000  335.000000  345.000000
max    400.000000  410.000000  420.000000

In [38]:
df1.describe(exclude=[object])

              vol         Rev         Exp
count    4.000000    4.000000    4.000000
mean   250.000000  260.000000  270.000000
std    129.099445  129.099445  129.099445
min    100.000000  110.000000  120.000000
25%    175.000000  185.000000  195.000000
50%    250.000000  260.000000  270.000000
75%    325.000000  335.000000  345.000000
max    400.000000  410.000000  420.000000

In [39]:
df1.describe(include=[object])

        HQ
count    4
unique   4
top     MB
freq     1

In [40]:
df1

        vol  Rev  Exp   HQ
INFY    100  110  120   MB
CTS     200  210  220  BLR
TCS     300  310  320  KOL
TECHON  400  410  420  CHN

In [41]:
df1.loc['ACCENTURE']=[600,610,620,'BLR']
df1

           vol  Rev  Exp   HQ
INFY       100  110  120   MB
CTS        200  210  220  BLR
TCS        300  310  320  KOL
TECHON     400  410  420  CHN
ACCENTURE  600  610  620  BLR

In [42]:
df1.describe(include=[object])

         HQ
count     5
unique    4
top     BLR
freq      2

In [43]:
# top is the most common value - Mode

By default describe takes only numerical elements

Add a row to a dataframe with an index name

In [44]:
df1.loc['WIPRO'] = [500,510,520,'HYD']

In [45]:
df1

           vol  Rev  Exp   HQ
INFY       100  110  120   MB
CTS        200  210  220  BLR
TCS        300  310  320  KOL
TECHON     400  410  420  CHN
ACCENTURE  600  610  620  BLR
WIPRO      500  510  520  HYD

Converting lists to dataframe

In [46]:
mylist1 = [[100,110,120,'MB'],[200,210,220,'BLR'],[300,310,320,'KOL'],[400,410,420,'CHN'],[500,510,520,'HYD']]
indx_lst = ['TCS','INFY','WIPRO','CTS','TECHON']
col_lst = ['Vol','Rev','Exp','HQ']

In [47]:
df2 = pd.DataFrame(mylist1,index=indx_lst,columns=col_lst)
df2

        Vol  Rev  Exp   HQ
TCS     100  110  120   MB
INFY    200  210  220  BLR
WIPRO   300  310  320  KOL
CTS     400  410  420  CHN
TECHON  500  510  520  HYD

In [48]:
df2.ndim

2

In [49]:
df2.shape

(5, 4)